htdocs/app/Models/ArticleModel.php

    public function insertIfNotExists($data)
    {
        $existing = $this->where('link', $data['link'])->first();

        if (!$existing) {
            return $this->insert($data);
---
SELECT *
FROM `articles`
WHERE `link` = 'https://www.begeek.fr/meta-preparerait-des-lunettes-connectees-integrant-la-correction-de-la-vue-430212'
 LIMIT 1
INSERT INTO `articles` (`title`, `link`, `description`, `pub_date`, `source`) VALUES ('Meta préparerait des lunettes connectées intégrant la correction de la vue - Begeek', 'https://www.begeek.fr/meta-preparerait-des-lunettes-connectees-integrant-la-correction-de-la-vue-430212', 'Selon des documents repérés par The Verge auprès de la Federal Communications Commission (FCC), ces deux produits, nommés en interne Scriber et Blazer ...', '2026-03-30 10:03:31', 'Google Alerts - objets connectés')