htdocs/app/Controllers/Home.php

    public function index()
    {
        helper('age');

        $infos_generalesModel = new PersonnelleModel();
        $lienExternesModel = new LienExternesModel();
        $loisirsModel = new LoisirsModel();

        $data = [
            'title' => 'Accueil - Portfolio',
            // Le CSS global (style.css) est déjà chargé dans le layout, pas besoin de l'ajouter ici
            'personne' => $infos_generalesModel->first(),
            'lienExternes' => $lienExternesModel->findAll(),
            'loisirs' => $loisirsModel->findAll(),
        ];
---
SELECT *
FROM `infos_generales`
 LIMIT 1
SELECT *
FROM `loisirs`

    public function tableau()
    {
        $catModel = new CategoriesBloc1Model();
        $compModel = new CompetencesAcocherModel();
        $justifModel = new JustificationModel();

        $categoriesBrutes = $catModel->findAll();
        $categories = [];

        foreach ($categoriesBrutes as $cat) {
            $competences = $compModel->where('id_categorie', $cat['id'])->orderBy('id', 'ASC')->findAll();

            foreach ($competences as &$comp) {
                if ('1' === $comp['vu'] && !empty($comp['id_justification'])) {
                    $comp['justification_data'] = $justifModel->find($comp['id_justification']);
---
SELECT *
FROM `categories_bloc_1`
SELECT *
FROM `competences_a_cocher`
WHERE `id_categorie` = '1'
ORDER BY `id` ASC
SELECT *
FROM `justification`
WHERE `justification`.`id` = '2'

    public function projets()
    {
        $projetModel = new ProjetModel();
        $data = [
            'title' => 'Mes Projets - Portfolio',
            'projets' => $projetModel->orderBy('id', 'DESC')->findAll(),
        ];
---
SELECT *
FROM `projets`
ORDER BY `id` DESC