htdocs/app/Controllers/Veille.php

SELECT *
FROM `articles`
ORDER BY `pub_date` DESC
---
    public function index()
    {
        helper('text');
        $articleModel = new ArticleModel();
        $syntheseModel = new SyntheseModel();

        $data = [
            'title'    => 'Ma Veille IoT',
            'css'      => ['veille_style.css'],
            // On récupère la dernière synthèse en date
            'synthese' => $syntheseModel->orderBy('date_mise_a_jour', 'DESC')->first(),
            // On récupère tous les articles normalement
            'articles' => $articleModel->orderBy('pub_date', 'DESC')->findAll(),
        ];